/* 
📝 크레인 인형뽑기(카카오 기출)

게임개발자인 죠르디는 크레인 인형뽑기 기계를 모바일 게임으로 만들려고 합니다.
죠르디는 게임의 재미를 높이기 위해 화면 구성과 규칙을 다음과 같이 게임 로직에 반영하려고 합니다.

게임 화면은 1 x 1 크기의 칸들로 이루어진 N x N 크기의 정사각 격자이며
위쪽에는 크레인이 있고 오른쪽에는 바구니가 있습니다. (위 그림은 5 x 5 크기의 예시입니다).

각 격자 칸에는 다양한 인형이 들어 있으며 인형이 없는 칸은 빈칸입니다.
모든 인형은 1 x 1 크기의 격자 한 칸을 차지하며 격자의 가장 아래 칸부터 차곡차곡 쌓여 있습니다.
게임 사용자는 크레인을 좌우로 움직여서 멈춘 위치에서 가장 위에 있는 인형을 집어 올릴 수 있습니다.
집어 올린 인형은 바구니에 쌓이게 되는 데, 이때 바구니의 가장 아래 칸부터 인형이 순서대로 쌓이게 됩니다.
다음 그림은 [1번, 5번, 3번] 위치에서 순서대로 인형을 집어 올려 바구니에 담은 모습입니다.

만약 같은 모양의 인형 두 개가 바구니에 연속해서 쌓이게 되면 두 인형은 터뜨려지면서 바구
니에서 사라지게 됩니다. 위 상태에서 이어서 [5번] 위치에서 인형을 집어 바구니에 쌓으면 
같은 모양 인형 두 개가 없어집니다.

크레인 작동 시 인형이 집어지지 않는 경우는 없으나 만약 인형이 없는 곳에서 크레인을 작동
시키는 경우에는 아무런 일도 일어나지 않습니다. 또한 바구니는 모든 인형이 들어갈 수 있을 
만큼 충분히 크다고 가정합니다. (그림에서는 화면표시 제약으로 5칸만으로 표현하였음)

게임 화면의 격자의 상태가 담긴 2차원 배열 board와 인형을 집기 위해
크레인을 작동시킨 위치가 담긴 배열 moves가 매개변수로 주어질 때,
크레인을 모두 작동시킨 후 터트려져 사라진 인형의 개수를 return 하도록 solution 함수를 완성해주세요.

▣ 제한사항
board 배열은 2차원 배열로 크기는 5 x 5 이상 30 x 30 이하입니다.
board의 각 칸에는 0 이상 100 이하인 정수가 담겨있습니다.
0은 빈 칸을 나타냅니다.
1 ~ 100의 각 숫자는 각기 다른 인형의 모양을 의미하며
같은 숫자는 같은 모양의 인형을 나타냅니다.
moves 배열의 크기는 1 이상 1,000 이하입니다.
moves 배열 각 원소들의 값은 1 이상이며 board 배열의 가로 크기 이하인 자연수입니다.

▣ 입력예제 1 
[[0,0,0,0,0],[0,0,1,0,3],[0,2,5,0,1],[4,2,4,4,2],[3,5,1,3,1]] //board 배열
[1,5,3,5,1,2,1,4] //moves 배열

▣ 출력예제 1
4

📝 강의 자료
function solution(board, moves){
  let answer=0;
  let stack=[];
  
  // forEach로 하나씩 꺼냄 (pos는 1, 5, 3, ...)

  moves.forEach(pos => {
    for(let i=0; i<board.length; i++){
      if(board[i][pos-1]!==0){
        // 꺼낸 인형
        let tmp=board[i][pos-1];
        board[i][pos-1]=0;
        // 꺼낸 인형과 마지막으로 넣은 인형이 같으면 펑!
        if(tmp===stack[stack.length-1]){
          stack.pop();
          answer+=2;
        }
        else stack.push(tmp);
        break;
      }
    }
  });
                  
  return answer;
}

let a=[
  [0,0,0,0,0],
  [0,0,1,0,3],
  [0,2,5,0,1],
  [4,2,4,4,2],
  [3,5,1,3,1]
];

let b=[1, 5, 3, 5, 1, 2, 1, 4];
console.log(solution(a, b));
*/

// (1) 강의 자료와 비슷하게 풀었다.

// 나는 이중 for of문 활용
// 강의자료는 forEach와 for문 활용
// 내 풀이와 강의자료 둘 다 0이 아닐때만 동작 수행

function solution(board, moves) {
  let n = board.length;
  let count = 0;
  
  // 집은 인형
  let stack = [];

  for (const move of moves) {
    for (const arr of board) {
      if (0 < arr[move - 1]) {
        // 현재 인형이 마지막으로 집은 인형과 같다면 펑!
        if (stack[stack.length - 1] === arr[move - 1]) {
          stack.pop();
          count += 2;
        } else {
          // 다르면 마지막으로 집은 인형에 푸시
          stack.push(arr[move - 1]);
        }
        // 집었으니 해당 공간은 비어짐
        arr[move - 1] = 0;
        break;
      }
    }
  }
  return count;
}

let board = [
  [0, 0, 0, 0, 0],
  [0, 0, 1, 0, 3],
  [0, 2, 5, 0, 1],
  [4, 2, 4, 4, 2],
  [3, 5, 1, 3, 1]
];
let moves = [1,5,3,5,1,2,1,4]
console.log(solution(board, moves));

// =============================

function solution(boards, moves) {

  let count = 0;

  // 잡은 인형
  let stack = [];

  for (const move of moves) {
    for (const board of boards) {
      if ( 0 < board[move - 1] ) {

        // 같은 인형일 경우
        if (stack[stack.length - 1] === board[move - 1]) {
          count += 2;
          stack.pop();
        } else stack.push(board[move - 1]);

        // 뽑은 인형은 0으로 변경
        board[move - 1] = 0;
        break;
      }
    }
  }

  return count;
}
let board2 = [
  [0, 0, 0, 0, 0],
  [0, 0, 1, 0, 3],
  [0, 2, 5, 0, 1],
  [4, 2, 4, 4, 2],
  [3, 5, 1, 3, 1]
];
let moves2 = [1, 5, 3, 5, 1, 2, 1, 4];
console.log(solution(board2, moves2));

// ↑ 크레인 인형뽑기, 각 격자에 있는 인형을 위에서부터 뽑으면 바구니에 쌓이는데
// 같은 인형을 연속해서 쌓으면 두 인형은 터져서 사라짐.
// 순서대로 집어올려서 바구니에 남는 인형을 구하는 알고리즘
// move 순회 중 해당 위치의 board가 0이 아닐 경우
// stack에 마지막으로 쌓인 인형인지 판별하고
// 같으면 count +2랑 pop, 다르면 stack에 push
// 뽑은 인형은 0 으로 변경 하여 풀었음