/* 
📝 교육과정 설계
현수는 1년 과정의 수업계획을 짜야 합니다.
수업중에는 필수과목이 있습니다. 이 필수과목은 반드시 이수해야 하며, 그 순서도 정해져 있습니다.

만약 총 과목이 A, B, C, D, E, F, G가 있고,
여기서 필수과목이 CBA로 주어지면 필수과목은 C, B, A과목이며 이 순서대로 꼭 수업계획을 짜야 합니다.

여기서 순서란 B과목은 C과목을 이수한 후에 들어야 하고, A과목은 C와 B를 이수한 후에 들어야 한다는 것입니다. 

현수가 C, B, D, A, G, E로 수업계획을 짜면 제대로 된 설계이지만
C, G, E, A, D, B 순서로 짰다면 잘 못 설계된 수업계획이 됩니다.

수업계획은 그 순서대로 앞에 수업이 이수되면 다음 수업을 시작하다는 것으로 해석합니다.
수업계획서상의 각 과목은 무조건 이수된다고 가정합니다.

필수과목순서가 주어지면 현수가 짠 N개의 수업설계가 잘된 것이면 “YES",
잘못된 것이면 ”NO“를 출력하는 프로그램을 작성하세요.

▣ 입력설명
첫 줄에 한 줄에 필수과목의 순서가 주어집니다. 모든 과목은 영문 대문자입니다.
두 번 째 줄부터 현수가 짠 수업설계가 주어집니다.(수업설계의 길이는 30이하이다)

▣ 출력설명
수업설계가 잘된 것이면 “YES", 잘못된 것이면 ”NO“를 출력합니다.

▣ 입력예제 1 
CBA
CBDAGE

▣ 출력예제 1
YES

📝 강의 자료
function solution(need, plan){
  let answer="YES";
  let queue=need.split('');
  for(let x of plan){
    // 수강과목 x가 필수과목에 포함할때만 확인
    if(queue.includes(x)){
      // 필수과목 queue의 첫 요소가 아니면 NO
      if(x!==queue.shift()) return "NO";
    }
  }
  // 모두 순회했음에도 필수과목 길이가 1이상이면
  // 수강하지 않았다는 것이니 NO
  if(queue.length>0) return "NO";  
  return answer;
}

let a="CBA";
let b="CBDAGE";
console.log(solution(a, b));
*/

// (1) 강의자료와 비슷하다
// 둘 다 첫번째 요소를 확인
// 강의자료는 shift를 먼저하고
// 내 풀이는 확인하고 shift를 한다.
function solution(must, plan) {

  let que = must.split('');

  // 수강 과목 전체 순회
  for (const item of plan) {
    // 필수과목의 첫번째면 shift
    if (item === que[0]) {
      que.shift();
    }
  }

  // 순서대로 수강했다면 길이가 0이여야한다.
  if (!que.length) return 'YES'
  else return 'NO'
}

console.log(solution('CBA', 'CBDAGE'));

// ===========================

function solution(need, plan) {
  let queue = [...need];
  for (const item of plan) {
    // 필수과목인지 확인하고 맞으면 제거
    if (item === needArr[0]) queue.shift();
  }
  if (queue.length === 0) return 'YES'
  else return 'NO'
};
console.log(solution('CAB', 'CBDAGE'));

// ↑ 필수과목(need)을 무조건 순서대로 이수해야하는데 수강과목(plan)이 잘된거면 YES 아니면 NO로 출력하는 알고리즘

